{
    "@odata.type":  "#microsoft.graph.androidGeneralDeviceConfiguration",
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "description":  "Android Configuration",
    "displayName":  "DC-AND",
    "appsBlockClipboardSharing":  false,
    "appsBlockCopyPaste":  false,
    "appsBlockYouTube":  false,
    "bluetoothBlocked":  false,
    "cameraBlocked":  false,
    "cellularBlockDataRoaming":  false,
    "cellularBlockMessaging":  false,
    "cellularBlockVoiceRoaming":  false,
    "cellularBlockWiFiTethering":  false,
    "compliantAppListType":  "none",
    "diagnosticDataBlockSubmission":  false,
    "locationServicesBlocked":  false,
    "googleAccountBlockAutoSync":  false,
    "googlePlayStoreBlocked":  false,
    "kioskModeBlockSleepButton":  false,
    "kioskModeBlockVolumeButtons":  false,
    "dateAndTimeBlockChanges":  false,
    "nfcBlocked":  false,
    "passwordBlockFingerprintUnlock":  false,
    "passwordBlockTrustAgents":  false,
    "passwordExpirationDays":  null,
    "passwordMinimumLength":  6,
    "passwordMinutesOfInactivityBeforeScreenTimeout":  5,
    "passwordPreviousPasswordBlockCount":  5,
    "passwordSignInFailureCountBeforeFactoryReset":  10,
    "passwordRequiredType":  "numericComplex",
    "passwordRequired":  true,
    "powerOffBlocked":  false,
    "factoryResetBlocked":  false,
    "screenCaptureBlocked":  false,
    "deviceSharingAllowed":  false,
    "storageBlockGoogleBackup":  false,
    "storageBlockRemovableStorage":  false,
    "storageRequireDeviceEncryption":  true,
    "storageRequireRemovableStorageEncryption":  false,
    "voiceAssistantBlocked":  false,
    "voiceDialingBlocked":  false,
    "webBrowserBlockPopups":  false,
    "webBrowserBlockAutofill":  false,
    "webBrowserBlockJavaScript":  false,
    "webBrowserBlocked":  false,
    "webBrowserCookieSettings":  "browserDefault",
    "wiFiBlocked":  false,
    "securityRequireVerifyApps":  false,
    "compliantAppsList":  [

                          ],
    "kioskModeApps":  [

                      ],
    "appsInstallAllowList":  [

                             ],
    "appsLaunchBlockList":  [

                            ],
    "appsHideList":  [

                     ]
}
