{
    "@odata.type":  "#microsoft.graph.windows10GeneralConfiguration",
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "description":  "Windows 10 - Device Restrictions",
    "displayName":  "DC-WIN-DR",
    "taskManagerBlockEndTask":  false,
    "windows10AppsForceUpdateSchedule":  null,
    "enableAutomaticRedeployment":  false,
    "microsoftAccountSignInAssistantSettings":  "notConfigured",
    "authenticationAllowSecondaryDevice":  true,
    "authenticationWebSignIn":  "enabled",
    "authenticationPreferredAzureADTenantDomainName":  "condicio.cloud",
    "cryptographyAllowFipsAlgorithmPolicy":  false,
    "displayAppListWithGdiDPIScalingTurnedOn":  [

                                                ],
    "displayAppListWithGdiDPIScalingTurnedOff":  [

                                                 ],
    "enterpriseCloudPrintDiscoveryEndPoint":  null,
    "enterpriseCloudPrintOAuthAuthority":  null,
    "enterpriseCloudPrintOAuthClientIdentifier":  null,
    "enterpriseCloudPrintResourceIdentifier":  null,
    "enterpriseCloudPrintDiscoveryMaxLimit":  null,
    "enterpriseCloudPrintMopriaDiscoveryResourceIdentifier":  null,
    "experienceDoNotSyncBrowserSettings":  "notConfigured",
    "messagingBlockSync":  false,
    "messagingBlockMMS":  false,
    "messagingBlockRichCommunicationServices":  false,
    "printerNames":  [

                     ],
    "printerDefaultName":  null,
    "printerBlockAddition":  false,
    "searchBlockDiacritics":  false,
    "searchDisableAutoLanguageDetection":  false,
    "searchDisableIndexingEncryptedItems":  false,
    "searchEnableRemoteQueries":  false,
    "searchDisableUseLocation":  false,
    "searchDisableLocation":  false,
    "searchDisableIndexerBackoff":  true,
    "searchDisableIndexingRemovableDrive":  true,
    "searchEnableAutomaticIndexSizeManangement":  false,
    "searchBlockWebResults":  false,
    "securityBlockAzureADJoinedDevicesAutoEncryption":  false,
    "diagnosticsDataSubmissionMode":  "full",
    "oneDriveDisableFileSync":  false,
    "systemTelemetryProxyServer":  null,
    "edgeTelemetryForMicrosoft365Analytics":  "intranetAndInternet",
    "inkWorkspaceAccess":  "notConfigured",
    "inkWorkspaceAccessState":  "notConfigured",
    "inkWorkspaceBlockSuggestedApps":  false,
    "smartScreenEnableAppInstallControl":  false,
    "smartScreenAppInstallControl":  "notConfigured",
    "personalizationDesktopImageUrl":  null,
    "personalizationLockScreenImageUrl":  null,
    "bluetoothAllowedServices":  [

                                 ],
    "bluetoothBlockAdvertising":  false,
    "bluetoothBlockPromptedProximalConnections":  false,
    "bluetoothBlockDiscoverableMode":  false,
    "bluetoothBlockPrePairing":  false,
    "edgeBlockAutofill":  false,
    "edgeBlocked":  false,
    "edgeCookiePolicy":  "userDefined",
    "edgeBlockDeveloperTools":  false,
    "edgeBlockSendingDoNotTrackHeader":  false,
    "edgeBlockExtensions":  false,
    "edgeBlockInPrivateBrowsing":  false,
    "edgeBlockJavaScript":  false,
    "edgeBlockPasswordManager":  false,
    "edgeBlockAddressBarDropdown":  false,
    "edgeBlockCompatibilityList":  false,
    "edgeClearBrowsingDataOnExit":  false,
    "edgeAllowStartPagesModification":  true,
    "edgeDisableFirstRunPage":  true,
    "edgeBlockLiveTileDataCollection":  true,
    "edgeSyncFavoritesWithInternetExplorer":  true,
    "edgeFavoritesListLocation":  null,
    "edgeBlockEditFavorites":  false,
    "edgeNewTabPageURL":  null,
    "edgeHomeButtonConfiguration":  null,
    "edgeHomeButtonConfigurationEnabled":  false,
    "edgeOpensWith":  "notConfigured",
    "edgeBlockSideloadingExtensions":  false,
    "edgeRequiredExtensionPackageFamilyNames":  [

                                                ],
    "edgeBlockPrinting":  false,
    "edgeFavoritesBarVisibility":  "notConfigured",
    "edgeBlockSavingHistory":  false,
    "edgeBlockFullScreenMode":  false,
    "edgeBlockWebContentOnNewTabPage":  false,
    "edgeBlockTabPreloading":  false,
    "edgeBlockPrelaunch":  false,
    "edgeShowMessageWhenOpeningInternetExplorerSites":  "notConfigured",
    "edgePreventCertificateErrorOverride":  false,
    "edgeKioskModeRestriction":  "notConfigured",
    "edgeKioskResetAfterIdleTimeInMinutes":  null,
    "cellularBlockDataWhenRoaming":  false,
    "cellularBlockVpn":  false,
    "cellularBlockVpnWhenRoaming":  false,
    "cellularData":  "allowed",
    "defenderBlockEndUserAccess":  false,
    "defenderDaysBeforeDeletingQuarantinedMalware":  14,
    "defenderSystemScanSchedule":  "userDefined",
    "defenderFilesAndFoldersToExclude":  [
                                             "%windir%\\softwaredistribution\\datastore",
                                             "%windir%\\softwaredistribution\\datastore\\logs",
                                             "%windir%\\security\\database",
                                             "%ALLUSERSPROFILE%\\Microsoft\\Windows\\Hyper-V",
                                             "%windir%\\containers"
                                         ],
    "defenderFileExtensionsToExclude":  [
                                            "Edb*.jrs",
                                            "Ebd.chk",
                                            "Tmp.edb",
                                            "OfficeClickToRun.exe",
                                            "ost",
                                            "pst"
                                        ],
    "defenderScanMaxCpu":  25,
    "defenderMonitorFileActivity":  "monitorIncomingFilesOnly",
    "defenderPotentiallyUnwantedAppAction":  "deviceDefault",
    "defenderPotentiallyUnwantedAppActionSetting":  "userDefined",
    "defenderProcessesToExclude":  [
                                       "%windir%\\Program Files\\printix.net\\Printix Client\\PrintixClient.exe"
                                   ],
    "defenderPromptForSampleSubmission":  "sendAllDataWithoutPrompting",
    "defenderRequireBehaviorMonitoring":  true,
    "defenderRequireCloudProtection":  true,
    "defenderRequireNetworkInspectionSystem":  true,
    "defenderRequireRealTimeMonitoring":  true,
    "defenderScanArchiveFiles":  true,
    "defenderScanDownloads":  true,
    "defenderScheduleScanEnableLowCpuPriority":  false,
    "defenderDisableCatchupQuickScan":  false,
    "defenderDisableCatchupFullScan":  false,
    "defenderScanNetworkFiles":  true,
    "defenderScanIncomingMail":  true,
    "defenderScanMappedNetworkDrivesDuringFullScan":  false,
    "defenderScanRemovableDrivesDuringFullScan":  true,
    "defenderScanScriptsLoadedInInternetExplorer":  true,
    "defenderSignatureUpdateIntervalInHours":  4,
    "defenderScanType":  "userDefined",
    "defenderScheduledScanTime":  null,
    "defenderScheduledQuickScanTime":  null,
    "defenderCloudBlockLevel":  "high",
    "defenderCloudExtendedTimeout":  null,
    "defenderCloudExtendedTimeoutInSeconds":  null,
    "defenderBlockOnAccessProtection":  false,
    "defenderSubmitSamplesConsentType":  "sendSafeSamplesAutomatically",
    "lockScreenAllowTimeoutConfiguration":  false,
    "lockScreenBlockActionCenterNotifications":  false,
    "lockScreenBlockCortana":  true,
    "lockScreenBlockToastNotifications":  true,
    "lockScreenTimeoutInSeconds":  null,
    "lockScreenActivateAppsWithVoice":  "notConfigured",
    "passwordBlockSimple":  true,
    "passwordExpirationDays":  360,
    "passwordMinimumLength":  6,
    "passwordMinutesOfInactivityBeforeScreenTimeout":  5,
    "passwordMinimumCharacterSetCount":  null,
    "passwordPreviousPasswordBlockCount":  5,
    "passwordRequired":  true,
    "passwordRequireWhenResumeFromIdleState":  true,
    "passwordRequiredType":  "deviceDefault",
    "passwordSignInFailureCountBeforeFactoryReset":  10,
    "passwordMinimumAgeInDays":  null,
    "privacyAdvertisingId":  "notConfigured",
    "privacyAutoAcceptPairingAndConsentPrompts":  false,
    "privacyDisableLaunchExperience":  false,
    "privacyBlockInputPersonalization":  false,
    "privacyBlockPublishUserActivities":  false,
    "privacyBlockActivityFeed":  false,
    "startBlockUnpinningAppsFromTaskbar":  false,
    "startMenuAppListVisibility":  "userDefined",
    "startMenuHideChangeAccountSettings":  false,
    "startMenuHideFrequentlyUsedApps":  false,
    "startMenuHideHibernate":  false,
    "startMenuHideLock":  false,
    "startMenuHidePowerButton":  false,
    "startMenuHideRecentJumpLists":  false,
    "startMenuHideRecentlyAddedApps":  false,
    "startMenuHideRestartOptions":  false,
    "startMenuHideShutDown":  false,
    "startMenuHideSignOut":  false,
    "startMenuHideSleep":  true,
    "startMenuHideSwitchAccount":  false,
    "startMenuHideUserTile":  false,
    "startMenuLayoutEdgeAssetsXml":  null,
    "startMenuLayoutXml":  "PExheW91dE1vZGlmaWNhdGlvblRlbXBsYXRlIHhtbG5zOmRlZmF1bHRsYXlvdXQ9Imh0dHA6Ly9zY2hlbWFzLm1pY3Jvc29mdC5jb20vU3RhcnQvMjAxNC9GdWxsRGVmYXVsdExheW91dCIgeG1sbnM6c3RhcnQ9Imh0dHA6Ly9zY2hlbWFzLm1pY3Jvc29mdC5jb20vU3RhcnQvMjAxNC9TdGFydExheW91dCIgVmVyc2lvbj0iMSIgeG1sbnM9Imh0dHA6Ly9zY2hlbWFzLm1pY3Jvc29mdC5jb20vU3RhcnQvMjAxNC9MYXlvdXRNb2RpZmljYXRpb24iPg0KICA8TGF5b3V0T3B0aW9ucyBTdGFydFRpbGVHcm91cENlbGxXaWR0aD0iNiIgLz4NCiAgPERlZmF1bHRMYXlvdXRPdmVycmlkZSBMYXlvdXRDdXN0b21pemF0aW9uUmVzdHJpY3Rpb25UeXBlPSJPbmx5U3BlY2lmaWVkR3JvdXBzIj4NCiAgICA8U3RhcnRMYXlvdXRDb2xsZWN0aW9uPg0KICAgICAgPGRlZmF1bHRsYXlvdXQ6U3RhcnRMYXlvdXQgR3JvdXBDZWxsV2lkdGg9IjYiPg0KICAgICAgICA8c3RhcnQ6R3JvdXAgTmFtZT0iQ29tcGFueSBBcHBzIj4NCiAgICAgICAgICA8c3RhcnQ6VGlsZSBTaXplPSIxeDEiIENvbHVtbj0iNCIgUm93PSI0IiBBcHBVc2VyTW9kZWxJRD0iTWljcm9zb2Z0LldpbmRvd3NDYWxjdWxhdG9yXzh3ZWt5YjNkOGJid2UhQXBwIiAvPg0KICAgICAgICAgIDxzdGFydDpEZXNrdG9wQXBwbGljYXRpb25UaWxlIFNpemU9IjJ4MiIgQ29sdW1uPSIwIiBSb3c9IjIiIERlc2t0b3BBcHBsaWNhdGlvbklEPSJNaWNyb3NvZnQuT2ZmaWNlLk9VVExPT0suRVhFLjE1IiAvPg0KICAgICAgICAgIDxzdGFydDpEZXNrdG9wQXBwbGljYXRpb25UaWxlIFNpemU9IjF4MSIgQ29sdW1uPSI1IiBSb3c9IjQiIERlc2t0b3BBcHBsaWNhdGlvbklEPSJDaHJvbWUiIC8+DQogICAgICAgICAgPHN0YXJ0OlRpbGUgU2l6ZT0iMngyIiBDb2x1bW49IjQiIFJvdz0iMCIgQXBwVXNlck1vZGVsSUQ9Ik1pY3Jvc29mdC5NaWNyb3NvZnRFZGdlXzh3ZWt5YjNkOGJid2UhTWljcm9zb2Z0RWRnZSIgLz4NCiAgICAgICAgICA8c3RhcnQ6RGVza3RvcEFwcGxpY2F0aW9uVGlsZSBTaXplPSIxeDEiIENvbHVtbj0iMiIgUm93PSI0IiBEZXNrdG9wQXBwbGljYXRpb25JRD0iTWljcm9zb2Z0Lk9mZmljZS5FWENFTC5FWEUuMTUiIC8+DQogICAgICAgICAgPHN0YXJ0OlRpbGUgU2l6ZT0iMngyIiBDb2x1bW49IjAiIFJvdz0iMCIgQXBwVXNlck1vZGVsSUQ9Ik1pY3Jvc29mdC5Db21wYW55UG9ydGFsXzh3ZWt5YjNkOGJid2UhQXBwIiAvPg0KICAgICAgICAgIDxzdGFydDpEZXNrdG9wQXBwbGljYXRpb25UaWxlIFNpemU9IjJ4MiIgQ29sdW1uPSIyIiBSb3c9IjAiIERlc2t0b3BBcHBsaWNhdGlvbklEPSJNaWNyb3NvZnQuU2t5RHJpdmUuRGVza3RvcCIgLz4NCiAgICAgICAgICA8c3RhcnQ6RGVza3RvcEFwcGxpY2F0aW9uVGlsZSBTaXplPSIxeDEiIENvbHVtbj0iMyIgUm93PSI0IiBEZXNrdG9wQXBwbGljYXRpb25JRD0iTWljcm9zb2Z0Lk9mZmljZS5XSU5XT1JELkVYRS4xNSIgLz4NCiAgICAgICAgICA8c3RhcnQ6RGVza3RvcEFwcGxpY2F0aW9uVGlsZSBTaXplPSIyeDIiIENvbHVtbj0iNCIgUm93PSIyIiBEZXNrdG9wQXBwbGljYXRpb25JRD0iY29tLnNxdWlycmVsLlRlYW1zLlRlYW1zIiAvPg0KICAgICAgICAgIDxzdGFydDpUaWxlIFNpemU9IjF4MSIgQ29sdW1uPSIwIiBSb3c9IjQiIEFwcFVzZXJNb2RlbElEPSJNaWNyb3NvZnQuT2ZmaWNlLk9uZU5vdGVfOHdla3liM2Q4YmJ3ZSFtaWNyb3NvZnQub25lbm90ZWltIiAvPg0KICAgICAgICAgIDxzdGFydDpEZXNrdG9wQXBwbGljYXRpb25UaWxlIFNpemU9IjF4MSIgQ29sdW1uPSIxIiBSb3c9IjQiIERlc2t0b3BBcHBsaWNhdGlvbklEPSJNaWNyb3NvZnQuT2ZmaWNlLlBPV0VSUE5ULkVYRS4xNSIgLz4NCiAgICAgICAgICA8c3RhcnQ6RGVza3RvcEFwcGxpY2F0aW9uVGlsZSBTaXplPSIyeDIiIENvbHVtbj0iMiIgUm93PSIyIiBEZXNrdG9wQXBwbGljYXRpb25JRD0iezdDNUE0MEVGLUEwRkItNEJGQy04NzRBLUMwRjJFMEI5RkE4RX1cQWRvYmVcQWNyb2JhdCBSZWFkZXIgRENcUmVhZGVyXEFjcm9SZDMyLmV4ZSIgLz4NCiAgICAgICAgPC9zdGFydDpHcm91cD4NCiAgICAgIDwvZGVmYXVsdGxheW91dDpTdGFydExheW91dD4NCiAgICA8L1N0YXJ0TGF5b3V0Q29sbGVjdGlvbj4NCiAgPC9EZWZhdWx0TGF5b3V0T3ZlcnJpZGU+DQo8L0xheW91dE1vZGlmaWNhdGlvblRlbXBsYXRlPg==",
    "startMenuMode":  "userDefined",
    "startMenuPinnedFolderDocuments":  "notConfigured",
    "startMenuPinnedFolderDownloads":  "notConfigured",
    "startMenuPinnedFolderFileExplorer":  "notConfigured",
    "startMenuPinnedFolderHomeGroup":  "hide",
    "startMenuPinnedFolderMusic":  "hide",
    "startMenuPinnedFolderNetwork":  "hide",
    "startMenuPinnedFolderPersonalFolder":  "hide",
    "startMenuPinnedFolderPictures":  "hide",
    "startMenuPinnedFolderSettings":  "notConfigured",
    "startMenuPinnedFolderVideos":  "hide",
    "settingsBlockSettingsApp":  false,
    "settingsBlockSystemPage":  false,
    "settingsBlockDevicesPage":  false,
    "settingsBlockNetworkInternetPage":  false,
    "settingsBlockPersonalizationPage":  false,
    "settingsBlockAccountsPage":  false,
    "settingsBlockTimeLanguagePage":  false,
    "settingsBlockEaseOfAccessPage":  true,
    "settingsBlockPrivacyPage":  false,
    "settingsBlockUpdateSecurityPage":  false,
    "settingsBlockAppsPage":  false,
    "settingsBlockGamingPage":  true,
    "windowsSpotlightBlockConsumerSpecificFeatures":  true,
    "windowsSpotlightBlocked":  false,
    "windowsSpotlightBlockOnActionCenter":  false,
    "windowsSpotlightBlockTailoredExperiences":  false,
    "windowsSpotlightBlockThirdPartyNotifications":  true,
    "windowsSpotlightBlockWelcomeExperience":  true,
    "windowsSpotlightBlockWindowsTips":  true,
    "windowsSpotlightConfigureOnLockScreen":  "notConfigured",
    "networkProxyApplySettingsDeviceWide":  false,
    "networkProxyDisableAutoDetect":  false,
    "networkProxyAutomaticConfigurationUrl":  null,
    "networkProxyServer":  null,
    "accountsBlockAddingNonMicrosoftAccountEmail":  true,
    "antiTheftModeBlocked":  false,
    "bluetoothBlocked":  false,
    "cameraBlocked":  false,
    "connectedDevicesServiceBlocked":  false,
    "certificatesBlockManualRootCertificateInstallation":  false,
    "copyPasteBlocked":  false,
    "cortanaBlocked":  false,
    "deviceManagementBlockFactoryResetOnMobile":  false,
    "deviceManagementBlockManualUnenroll":  true,
    "safeSearchFilter":  "userDefined",
    "edgeBlockPopups":  true,
    "edgeBlockSearchSuggestions":  false,
    "edgeBlockSearchEngineCustomization":  false,
    "edgeBlockSendingIntranetTrafficToInternetExplorer":  false,
    "edgeSendIntranetTrafficToInternetExplorer":  false,
    "edgeRequireSmartScreen":  true,
    "edgeEnterpriseModeSiteListLocation":  null,
    "edgeFirstRunUrl":  null,
    "edgeHomepageUrls":  [

                         ],
    "edgeBlockAccessToAboutFlags":  false,
    "smartScreenBlockPromptOverride":  true,
    "smartScreenBlockPromptOverrideForFiles":  true,
    "webRtcBlockLocalhostIpAddress":  true,
    "internetSharingBlocked":  false,
    "settingsBlockAddProvisioningPackage":  false,
    "settingsBlockRemoveProvisioningPackage":  true,
    "settingsBlockChangeSystemTime":  false,
    "settingsBlockEditDeviceName":  false,
    "settingsBlockChangeRegion":  false,
    "settingsBlockChangeLanguage":  false,
    "settingsBlockChangePowerSleep":  false,
    "locationServicesBlocked":  false,
    "microsoftAccountBlocked":  false,
    "microsoftAccountBlockSettingsSync":  false,
    "nfcBlocked":  false,
    "resetProtectionModeBlocked":  false,
    "screenCaptureBlocked":  false,
    "storageBlockRemovableStorage":  false,
    "storageRequireMobileDeviceEncryption":  false,
    "usbBlocked":  false,
    "voiceRecordingBlocked":  false,
    "wiFiBlockAutomaticConnectHotspots":  false,
    "wiFiBlocked":  false,
    "wiFiBlockManualConfiguration":  false,
    "wiFiScanInterval":  null,
    "wirelessDisplayBlockProjectionToThisDevice":  false,
    "wirelessDisplayBlockUserInputFromReceiver":  false,
    "wirelessDisplayRequirePinForPairing":  false,
    "windowsStoreBlocked":  false,
    "appsAllowTrustedAppsSideloading":  "allowed",
    "windowsStoreBlockAutoUpdate":  false,
    "developerUnlockSetting":  "notConfigured",
    "sharedUserAppDataAllowed":  false,
    "appsBlockWindowsStoreOriginatedApps":  false,
    "windowsStoreEnablePrivateStoreOnly":  false,
    "storageRestrictAppDataToSystemVolume":  false,
    "storageRestrictAppInstallToSystemVolume":  false,
    "gameDvrBlocked":  false,
    "experienceBlockDeviceDiscovery":  false,
    "experienceBlockErrorDialogWhenNoSIM":  false,
    "experienceBlockTaskSwitcher":  false,
    "logonBlockFastUserSwitching":  false,
    "tenantLockdownRequireNetworkDuringOutOfBoxExperience":  false,
    "appManagementMSIAllowUserControlOverInstall":  false,
    "appManagementMSIAlwaysInstallWithElevatedPrivileges":  false,
    "dataProtectionBlockDirectMemoryAccess":  false,
    "appManagementPackageFamilyNamesToLaunchAfterLogOn":  [

                                                          ],
    "defenderDetectedMalwareActions":  {
                                           "lowSeverity":  "quarantine",
                                           "moderateSeverity":  "quarantine",
                                           "highSeverity":  "remove",
                                           "severeSeverity":  "remove"
                                       },
    "edgeSearchEngine":  {
                             "@odata.type":  "#microsoft.graph.edgeSearchEngineCustom",
                             "edgeSearchEngineOpenSearchXmlUrl":  "https://go.microsoft.com/fwlink/?linkid=842596"
                         }
}
