{
  "@odata.context": "https://graph.microsoft.com/Beta/$metadata#deviceManagement/deviceConfigurations/$entity",
  "@odata.type": "#microsoft.graph.windows10GeneralConfiguration",
  "description": "",
  "displayName": "testname",
  "taskManagerBlockEndTask": false,
  "windows10AppsForceUpdateSchedule": null,
  "enableAutomaticRedeployment": false,
  "microsoftAccountSignInAssistantSettings": "notConfigured",
  "authenticationAllowSecondaryDevice": false,
  "authenticationWebSignIn": "notConfigured",
  "authenticationPreferredAzureADTenantDomainName": null,
  "cryptographyAllowFipsAlgorithmPolicy": false,
  "displayAppListWithGdiDPIScalingTurnedOn": [],
  "displayAppListWithGdiDPIScalingTurnedOff": [],
  "enterpriseCloudPrintDiscoveryEndPoint": null,
  "enterpriseCloudPrintOAuthAuthority": null,
  "enterpriseCloudPrintOAuthClientIdentifier": null,
  "enterpriseCloudPrintResourceIdentifier": null,
  "enterpriseCloudPrintDiscoveryMaxLimit": null,
  "enterpriseCloudPrintMopriaDiscoveryResourceIdentifier": null,
  "experienceDoNotSyncBrowserSettings": "notConfigured",
  "messagingBlockSync": false,
  "messagingBlockMMS": false,
  "messagingBlockRichCommunicationServices": false,
  "printerNames": [],
  "printerDefaultName": null,
  "printerBlockAddition": false,
  "searchBlockDiacritics": false,
  "searchDisableAutoLanguageDetection": false,
  "searchDisableIndexingEncryptedItems": false,
  "searchEnableRemoteQueries": false,
  "searchDisableUseLocation": false,
  "searchDisableLocation": false,
  "searchDisableIndexerBackoff": false,
  "searchDisableIndexingRemovableDrive": false,
  "searchEnableAutomaticIndexSizeManangement": false,
  "searchBlockWebResults": false,
  "securityBlockAzureADJoinedDevicesAutoEncryption": false,
  "diagnosticsDataSubmissionMode": "userDefined",
  "oneDriveDisableFileSync": false,
  "systemTelemetryProxyServer": null,
  "edgeTelemetryForMicrosoft365Analytics": "notConfigured",
  "inkWorkspaceAccess": "notConfigured",
  "inkWorkspaceAccessState": "notConfigured",
  "inkWorkspaceBlockSuggestedApps": false,
  "smartScreenEnableAppInstallControl": false,
  "personalizationDesktopImageUrl": "blabla",
  "personalizationLockScreenImageUrl": "test 2",
  "bluetoothAllowedServices": [],
  "bluetoothBlockAdvertising": false,
  "bluetoothBlockPromptedProximalConnections": false,
  "bluetoothBlockDiscoverableMode": false,
  "bluetoothBlockPrePairing": false,
  "edgeBlockAutofill": false,
  "edgeBlocked": false,
  "edgeCookiePolicy": "userDefined",
  "edgeBlockDeveloperTools": false,
  "edgeBlockSendingDoNotTrackHeader": false,
  "edgeBlockExtensions": false,
  "edgeBlockInPrivateBrowsing": false,
  "edgeBlockJavaScript": false,
  "edgeBlockPasswordManager": false,
  "edgeBlockAddressBarDropdown": false,
  "edgeBlockCompatibilityList": false,
  "edgeClearBrowsingDataOnExit": false,
  "edgeAllowStartPagesModification": false,
  "edgeDisableFirstRunPage": false,
  "edgeBlockLiveTileDataCollection": false,
  "edgeSyncFavoritesWithInternetExplorer": false,
  "edgeFavoritesListLocation": null,
  "edgeBlockEditFavorites": false,
  "edgeNewTabPageURL": null,
  "edgeHomeButtonConfiguration": null,
  "edgeHomeButtonConfigurationEnabled": false,
  "edgeOpensWith": "notConfigured",
  "edgeBlockSideloadingExtensions": false,
  "edgeRequiredExtensionPackageFamilyNames": [],
  "edgeBlockPrinting": false,
  "edgeFavoritesBarVisibility": "notConfigured",
  "edgeBlockSavingHistory": false,
  "edgeBlockFullScreenMode": false,
  "edgeBlockWebContentOnNewTabPage": false,
  "edgeBlockTabPreloading": false,
  "edgeBlockPrelaunch": false,
  "edgeShowMessageWhenOpeningInternetExplorerSites": "notConfigured",
  "edgePreventCertificateErrorOverride": false,
  "edgeKioskModeRestriction": "notConfigured",
  "edgeKioskResetAfterIdleTimeInMinutes": null,
  "cellularBlockDataWhenRoaming": false,
  "cellularBlockVpn": false,
  "cellularBlockVpnWhenRoaming": false,
  "cellularData": "allowed",
  "defenderBlockEndUserAccess": false,
  "defenderDaysBeforeDeletingQuarantinedMalware": null,
  "defenderDetectedMalwareActions": null,
  "defenderSystemScanSchedule": "userDefined",
  "defenderFilesAndFoldersToExclude": [],
  "defenderFileExtensionsToExclude": [],
  "defenderScanMaxCpu": null,
  "defenderMonitorFileActivity": "userDefined",
  "defenderPotentiallyUnwantedAppAction": "deviceDefault",
  "defenderPotentiallyUnwantedAppActionSetting": "userDefined",
  "defenderProcessesToExclude": [],
  "defenderPromptForSampleSubmission": "userDefined",
  "defenderRequireBehaviorMonitoring": false,
  "defenderRequireCloudProtection": false,
  "defenderRequireNetworkInspectionSystem": false,
  "defenderRequireRealTimeMonitoring": false,
  "defenderScanArchiveFiles": false,
  "defenderScanDownloads": false,
  "defenderScheduleScanEnableLowCpuPriority": false,
  "defenderDisableCatchupQuickScan": false,
  "defenderDisableCatchupFullScan": false,
  "defenderScanNetworkFiles": false,
  "defenderScanIncomingMail": false,
  "defenderScanMappedNetworkDrivesDuringFullScan": false,
  "defenderScanRemovableDrivesDuringFullScan": false,
  "defenderScanScriptsLoadedInInternetExplorer": false,
  "defenderSignatureUpdateIntervalInHours": null,
  "defenderScanType": "userDefined",
  "defenderScheduledScanTime": null,
  "defenderScheduledQuickScanTime": null,
  "defenderCloudBlockLevel": "notConfigured",
  "defenderCloudExtendedTimeout": null,
  "defenderCloudExtendedTimeoutInSeconds": null,
  "defenderBlockOnAccessProtection": false,
  "defenderSubmitSamplesConsentType": "sendSafeSamplesAutomatically",
  "lockScreenAllowTimeoutConfiguration": false,
  "lockScreenBlockActionCenterNotifications": false,
  "lockScreenBlockCortana": true,
  "lockScreenBlockToastNotifications": false,
  "lockScreenTimeoutInSeconds": null,
  "passwordBlockSimple": false,
  "passwordExpirationDays": null,
  "passwordMinimumLength": null,
  "passwordMinutesOfInactivityBeforeScreenTimeout": null,
  "passwordMinimumCharacterSetCount": null,
  "passwordPreviousPasswordBlockCount": null,
  "passwordRequired": false,
  "passwordRequireWhenResumeFromIdleState": false,
  "passwordRequiredType": "deviceDefault",
  "passwordSignInFailureCountBeforeFactoryReset": null,
  "passwordMinimumAgeInDays": null,
  "privacyAdvertisingId": "notConfigured",
  "privacyAutoAcceptPairingAndConsentPrompts": false,
  "privacyDisableLaunchExperience": false,
  "privacyBlockInputPersonalization": false,
  "privacyBlockPublishUserActivities": false,
  "privacyBlockActivityFeed": false,
  "startBlockUnpinningAppsFromTaskbar": false,
  "startMenuAppListVisibility": "userDefined",
  "startMenuHideChangeAccountSettings": false,
  "startMenuHideFrequentlyUsedApps": false,
  "startMenuHideHibernate": false,
  "startMenuHideLock": false,
  "startMenuHidePowerButton": false,
  "startMenuHideRecentJumpLists": false,
  "startMenuHideRecentlyAddedApps": false,
  "startMenuHideRestartOptions": false,
  "startMenuHideShutDown": false,
  "startMenuHideSignOut": false,
  "startMenuHideSleep": false,
  "startMenuHideSwitchAccount": false,
  "startMenuHideUserTile": false,
  "startMenuLayoutEdgeAssetsXml": null,
  "startMenuLayoutXml": null,
  "startMenuMode": "userDefined",
  "startMenuPinnedFolderDocuments": "notConfigured",
  "startMenuPinnedFolderDownloads": "notConfigured",
  "startMenuPinnedFolderFileExplorer": "notConfigured",
  "startMenuPinnedFolderHomeGroup": "notConfigured",
  "startMenuPinnedFolderMusic": "notConfigured",
  "startMenuPinnedFolderNetwork": "notConfigured",
  "startMenuPinnedFolderPersonalFolder": "notConfigured",
  "startMenuPinnedFolderPictures": "notConfigured",
  "startMenuPinnedFolderSettings": "notConfigured",
  "startMenuPinnedFolderVideos": "notConfigured",
  "settingsBlockSettingsApp": false,
  "settingsBlockSystemPage": false,
  "settingsBlockDevicesPage": false,
  "settingsBlockNetworkInternetPage": false,
  "settingsBlockPersonalizationPage": false,
  "settingsBlockAccountsPage": false,
  "settingsBlockTimeLanguagePage": false,
  "settingsBlockEaseOfAccessPage": false,
  "settingsBlockPrivacyPage": false,
  "settingsBlockUpdateSecurityPage": false,
  "settingsBlockAppsPage": false,
  "settingsBlockGamingPage": false,
  "windowsSpotlightBlockConsumerSpecificFeatures": false,
  "windowsSpotlightBlocked": false,
  "windowsSpotlightBlockOnActionCenter": false,
  "windowsSpotlightBlockTailoredExperiences": false,
  "windowsSpotlightBlockThirdPartyNotifications": false,
  "windowsSpotlightBlockWelcomeExperience": false,
  "windowsSpotlightBlockWindowsTips": false,
  "windowsSpotlightConfigureOnLockScreen": "notConfigured",
  "networkProxyApplySettingsDeviceWide": false,
  "networkProxyDisableAutoDetect": false,
  "networkProxyAutomaticConfigurationUrl": null,
  "networkProxyServer": null,
  "accountsBlockAddingNonMicrosoftAccountEmail": false,
  "antiTheftModeBlocked": false,
  "bluetoothBlocked": false,
  "cameraBlocked": false,
  "connectedDevicesServiceBlocked": false,
  "certificatesBlockManualRootCertificateInstallation": false,
  "copyPasteBlocked": false,
  "cortanaBlocked": false,
  "deviceManagementBlockFactoryResetOnMobile": false,
  "deviceManagementBlockManualUnenroll": false,
  "safeSearchFilter": "userDefined",
  "edgeBlockPopups": false,
  "edgeBlockSearchSuggestions": false,
  "edgeBlockSearchEngineCustomization": false,
  "edgeBlockSendingIntranetTrafficToInternetExplorer": false,
  "edgeSendIntranetTrafficToInternetExplorer": false,
  "edgeRequireSmartScreen": false,
  "edgeEnterpriseModeSiteListLocation": null,
  "edgeFirstRunUrl": null,
  "edgeSearchEngine": null,
  "edgeHomepageUrls": [],
  "edgeBlockAccessToAboutFlags": false,
  "smartScreenBlockPromptOverride": false,
  "smartScreenBlockPromptOverrideForFiles": false,
  "webRtcBlockLocalhostIpAddress": false,
  "internetSharingBlocked": false,
  "settingsBlockAddProvisioningPackage": false,
  "settingsBlockRemoveProvisioningPackage": false,
  "settingsBlockChangeSystemTime": false,
  "settingsBlockEditDeviceName": false,
  "settingsBlockChangeRegion": false,
  "settingsBlockChangeLanguage": false,
  "settingsBlockChangePowerSleep": false,
  "locationServicesBlocked": false,
  "microsoftAccountBlocked": false,
  "microsoftAccountBlockSettingsSync": false,
  "nfcBlocked": false,
  "resetProtectionModeBlocked": false,
  "screenCaptureBlocked": false,
  "storageBlockRemovableStorage": false,
  "storageRequireMobileDeviceEncryption": false,
  "usbBlocked": false,
  "voiceRecordingBlocked": false,
  "wiFiBlockAutomaticConnectHotspots": false,
  "wiFiBlocked": false,
  "wiFiBlockManualConfiguration": false,
  "wiFiScanInterval": null,
  "wirelessDisplayBlockProjectionToThisDevice": false,
  "wirelessDisplayBlockUserInputFromReceiver": false,
  "wirelessDisplayRequirePinForPairing": false,
  "windowsStoreBlocked": false,
  "appsAllowTrustedAppsSideloading": "notConfigured",
  "windowsStoreBlockAutoUpdate": false,
  "developerUnlockSetting": "notConfigured",
  "sharedUserAppDataAllowed": false,
  "appsBlockWindowsStoreOriginatedApps": false,
  "windowsStoreEnablePrivateStoreOnly": false,
  "storageRestrictAppDataToSystemVolume": false,
  "storageRestrictAppInstallToSystemVolume": false,
  "gameDvrBlocked": false,
  "experienceBlockDeviceDiscovery": false,
  "experienceBlockErrorDialogWhenNoSIM": false,
  "experienceBlockTaskSwitcher": false,
  "logonBlockFastUserSwitching": false,
  "tenantLockdownRequireNetworkDuringOutOfBoxExperience": false,
  "appManagementMSIAllowUserControlOverInstall": false,
  "appManagementMSIAlwaysInstallWithElevatedPrivileges": false,
  "dataProtectionBlockDirectMemoryAccess": false,
  "appManagementPackageFamilyNamesToLaunchAfterLogOn": []
}
