{
    "@odata.type":  "#microsoft.graph.windows10CompliancePolicy",
    "description":  "Device Compliance Policy for Windows 10.",
    "displayName":  "DCO-WIN",
    "passwordRequired":  true,
    "passwordBlockSimple":  true,
    "scheduledActionsForRule": [
        {
            "ruleName": "BitlockerRequired",
            "scheduledActionConfigurations": [
                {
                    "actionType": "block",
                    "gracePeriodHours": 24,
                    "notificationTemplateId": ""
                }
            ]
        }
    ],
    "passwordRequiredToUnlockFromIdle":  false,
    "passwordMinutesOfInactivityBeforeLock":  5,
    "passwordExpirationDays":  180,
    "passwordMinimumLength":  6,
    "passwordMinimumCharacterSetCount":  null,
    "passwordRequiredType":  "deviceDefault",
    "passwordPreviousPasswordBlockCount":  5,
    "requireHealthyDeviceReport":  false,
    "osMinimumVersion":  "10.0.16299",
    "osMaximumVersion":  null,
    "mobileOsMinimumVersion":  null,
    "mobileOsMaximumVersion":  null,
    "earlyLaunchAntiMalwareDriverEnabled":  false,
    "bitLockerEnabled":  true,
    "secureBootEnabled":  true,
    "codeIntegrityEnabled":  true,
    "storageRequireEncryption":  true,
    "activeFirewallRequired":  true,
    "defenderEnabled":  true,
    "defenderVersion":  null,
    "signatureOutOfDate":  true,
    "rtpEnabled":  true,
    "antivirusRequired":  true,
    "antiSpywareRequired":  true,
    "deviceThreatProtectionEnabled":  true,
    "deviceThreatProtectionRequiredSecurityLevel":  "medium",
    "configurationManagerComplianceRequired":  false,
    "tpmRequired":  true,
    "validOperatingSystemBuildRanges":  [

                                        ]
}
