{
    "@odata.type":  "#microsoft.graph.androidWorkProfileGeneralDeviceConfiguration",
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "description":  "Android Enterprise Configuration",
    "displayName":  "DC-ANDENT",
    "passwordBlockFingerprintUnlock":  false,
    "passwordBlockTrustAgents":  false,
    "passwordExpirationDays":  null,
    "passwordMinimumLength":  6,
    "passwordMinutesOfInactivityBeforeScreenTimeout":  5,
    "passwordPreviousPasswordBlockCount":  5,
    "passwordSignInFailureCountBeforeFactoryReset":  10,
    "passwordRequiredType":  "atLeastNumeric",
    "workProfileDataSharingType":  "noRestrictions",
    "workProfileBlockNotificationsWhileDeviceLocked":  true,
    "workProfileBlockAddingAccounts":  false,
    "workProfileBluetoothEnableContactSharing":  true,
    "workProfileBlockScreenCapture":  false,
    "workProfileBlockCrossProfileCallerId":  false,
    "workProfileBlockCamera":  false,
    "workProfileBlockCrossProfileContactsSearch":  false,
    "workProfileBlockCrossProfileCopyPaste":  false,
    "workProfileDefaultAppPermissionPolicy":  "deviceDefault",
    "workProfilePasswordBlockFingerprintUnlock":  false,
    "workProfilePasswordBlockTrustAgents":  false,
    "workProfilePasswordExpirationDays":  360,
    "workProfilePasswordMinimumLength":  6,
    "workProfilePasswordMinNumericCharacters":  null,
    "workProfilePasswordMinNonLetterCharacters":  null,
    "workProfilePasswordMinLetterCharacters":  null,
    "workProfilePasswordMinLowerCaseCharacters":  null,
    "workProfilePasswordMinUpperCaseCharacters":  null,
    "workProfilePasswordMinSymbolCharacters":  null,
    "workProfilePasswordMinutesOfInactivityBeforeScreenTimeout":  15,
    "workProfilePasswordPreviousPasswordBlockCount":  5,
    "workProfilePasswordSignInFailureCountBeforeFactoryReset":  10,
    "workProfilePasswordRequiredType":  "atLeastNumeric",
    "workProfileRequirePassword":  true,
    "securityRequireVerifyApps":  true,
    "vpnAlwaysOnPackageIdentifier":  null,
    "vpnEnableAlwaysOnLockdownMode":  false
}
