{
    "@odata.context": "https://graph.microsoft.com/Beta/$metadata#deviceManagement/deviceConfigurations/$entity",
    "@odata.type": "#microsoft.graph.windows10EndpointProtectionConfiguration",
    "description": "Will only work for 1809 devices.",
    "displayName": "Win10 Bitlocker",
    "dmaGuardDeviceEnumerationPolicy": "deviceDefault",
    "userRightsAccessCredentialManagerAsTrustedCaller": null,
    "userRightsAllowAccessFromNetwork": null,
    "userRightsBlockAccessFromNetwork": null,
    "userRightsActAsPartOfTheOperatingSystem": null,
    "userRightsLocalLogOn": null,
    "userRightsBackupData": null,
    "userRightsChangeSystemTime": null,
    "userRightsCreateGlobalObjects": null,
    "userRightsCreatePageFile": null,
    "userRightsCreatePermanentSharedObjects": null,
    "userRightsCreateSymbolicLinks": null,
    "userRightsCreateToken": null,
    "userRightsDebugPrograms": null,
    "userRightsRemoteDesktopServicesLogOn": null,
    "userRightsDelegation": null,
    "userRightsGenerateSecurityAudits": null,
    "userRightsImpersonateClient": null,
    "userRightsIncreaseSchedulingPriority": null,
    "userRightsLoadUnloadDrivers": null,
    "userRightsLockMemory": null,
    "userRightsManageAuditingAndSecurityLogs": null,
    "userRightsManageVolumes": null,
    "userRightsModifyFirmwareEnvironment": null,
    "userRightsModifyObjectLabels": null,
    "userRightsProfileSingleProcess": null,
    "userRightsRemoteShutdown": null,
    "userRightsRestoreData": null,
    "userRightsTakeOwnership": null,
    "userRightsRegisterProcessAsService": null,
    "xboxServicesEnableXboxGameSaveTask": false,
    "xboxServicesAccessoryManagementServiceStartupMode": "manual",
    "xboxServicesLiveAuthManagerServiceStartupMode": "manual",
    "xboxServicesLiveGameSaveServiceStartupMode": "manual",
    "xboxServicesLiveNetworkingServiceStartupMode": "manual",
    "localSecurityOptionsBlockMicrosoftAccounts": false,
    "localSecurityOptionsBlockRemoteLogonWithBlankPassword": false,
    "localSecurityOptionsDisableAdministratorAccount": false,
    "localSecurityOptionsAdministratorAccountName": null,
    "localSecurityOptionsDisableGuestAccount": false,
    "localSecurityOptionsGuestAccountName": null,
    "localSecurityOptionsAllowUndockWithoutHavingToLogon": false,
    "localSecurityOptionsBlockUsersInstallingPrinterDrivers": false,
    "localSecurityOptionsBlockRemoteOpticalDriveAccess": false,
    "localSecurityOptionsFormatAndEjectOfRemovableMediaAllowedUser": "notConfigured",
    "localSecurityOptionsMachineInactivityLimit": null,
    "localSecurityOptionsMachineInactivityLimitInMinutes": null,
    "localSecurityOptionsDoNotRequireCtrlAltDel": false,
    "localSecurityOptionsHideLastSignedInUser": false,
    "localSecurityOptionsHideUsernameAtSignIn": false,
    "localSecurityOptionsLogOnMessageTitle": null,
    "localSecurityOptionsLogOnMessageText": null,
    "localSecurityOptionsAllowPKU2UAuthenticationRequests": false,
    "localSecurityOptionsAllowRemoteCallsToSecurityAccountsManagerHelperBool": false,
    "localSecurityOptionsAllowRemoteCallsToSecurityAccountsManager": null,
    "localSecurityOptionsMinimumSessionSecurityForNtlmSspBasedClients": "none",
    "localSecurityOptionsMinimumSessionSecurityForNtlmSspBasedServers": "none",
    "lanManagerAuthenticationLevel": "lmAndNltm",
    "lanManagerWorkstationDisableInsecureGuestLogons": false,
    "localSecurityOptionsClearVirtualMemoryPageFile": false,
    "localSecurityOptionsAllowSystemToBeShutDownWithoutHavingToLogOn": false,
    "localSecurityOptionsAllowUIAccessApplicationElevation": false,
    "localSecurityOptionsVirtualizeFileAndRegistryWriteFailuresToPerUserLocations": false,
    "localSecurityOptionsOnlyElevateSignedExecutables": false,
    "localSecurityOptionsAdministratorElevationPromptBehavior": "notConfigured",
    "localSecurityOptionsStandardUserElevationPromptBehavior": "notConfigured",
    "localSecurityOptionsSwitchToSecureDesktopWhenPromptingForElevation": false,
    "localSecurityOptionsDetectApplicationInstallationsAndPromptForElevation": false,
    "localSecurityOptionsAllowUIAccessApplicationsForSecureLocations": false,
    "localSecurityOptionsUseAdminApprovalMode": false,
    "localSecurityOptionsUseAdminApprovalModeForAdministrators": false,
    "localSecurityOptionsInformationShownOnLockScreen": "notConfigured",
    "localSecurityOptionsInformationDisplayedOnLockScreen": "notConfigured",
    "localSecurityOptionsDisableClientDigitallySignCommunicationsIfServerAgrees": false,
    "localSecurityOptionsClientDigitallySignCommunicationsAlways": false,
    "localSecurityOptionsClientSendUnencryptedPasswordToThirdPartySMBServers": false,
    "localSecurityOptionsDisableServerDigitallySignCommunicationsAlways": false,
    "localSecurityOptionsDisableServerDigitallySignCommunicationsIfClientAgrees": false,
    "localSecurityOptionsRestrictAnonymousAccessToNamedPipesAndShares": false,
    "localSecurityOptionsDoNotAllowAnonymousEnumerationOfSAMAccounts": false,
    "localSecurityOptionsAllowAnonymousEnumerationOfSAMAccountsAndShares": false,
    "localSecurityOptionsDoNotStoreLANManagerHashValueOnNextPasswordChange": false,
    "localSecurityOptionsSmartCardRemovalBehavior": "lockWorkstation",
    "defenderSecurityCenterDisableAppBrowserUI": false,
    "defenderSecurityCenterDisableFamilyUI": false,
    "defenderSecurityCenterDisableHealthUI": false,
    "defenderSecurityCenterDisableNetworkUI": false,
    "defenderSecurityCenterDisableVirusUI": false,
    "defenderSecurityCenterDisableAccountUI": false,
    "defenderSecurityCenterDisableClearTpmUI": false,
    "defenderSecurityCenterDisableHardwareUI": false,
    "defenderSecurityCenterDisableNotificationAreaUI": false,
    "defenderSecurityCenterDisableRansomwareUI": false,
    "defenderSecurityCenterDisableSecureBootUI": false,
    "defenderSecurityCenterDisableTroubleshootingUI": false,
    "defenderSecurityCenterDisableVulnerableTpmFirmwareUpdateUI": false,
    "defenderSecurityCenterOrganizationDisplayName": null,
    "defenderSecurityCenterHelpEmail": null,
    "defenderSecurityCenterHelpPhone": null,
    "defenderSecurityCenterHelpURL": null,
    "defenderSecurityCenterNotificationsFromApp": "notConfigured",
    "defenderSecurityCenterITContactDisplay": "notConfigured",
    "firewallBlockStatefulFTP": false,
    "firewallIdleTimeoutForSecurityAssociationInSeconds": null,
    "firewallPreSharedKeyEncodingMethod": "deviceDefault",
    "firewallIPSecExemptionsAllowNeighborDiscovery": false,
    "firewallIPSecExemptionsAllowICMP": false,
    "firewallIPSecExemptionsAllowRouterDiscovery": false,
    "firewallIPSecExemptionsAllowDHCP": false,
    "firewallCertificateRevocationListCheckMethod": "deviceDefault",
    "firewallMergeKeyingModuleSettings": false,
    "firewallPacketQueueingMethod": "deviceDefault",
    "firewallProfileDomain": null,
    "firewallProfilePublic": null,
    "firewallProfilePrivate": null,
    "defenderAdobeReaderLaunchChildProcess": "userDefined",
    "defenderAttackSurfaceReductionExcludedPaths": [],
    "defenderOfficeAppsOtherProcessInjectionType": "userDefined",
    "defenderOfficeAppsOtherProcessInjection": "userDefined",
    "defenderOfficeCommunicationAppsLaunchChildProcess": "userDefined",
    "defenderOfficeAppsExecutableContentCreationOrLaunchType": "userDefined",
    "defenderOfficeAppsExecutableContentCreationOrLaunch": "userDefined",
    "defenderOfficeAppsLaunchChildProcessType": "userDefined",
    "defenderOfficeAppsLaunchChildProcess": "userDefined",
    "defenderOfficeMacroCodeAllowWin32ImportsType": "userDefined",
    "defenderOfficeMacroCodeAllowWin32Imports": "userDefined",
    "defenderScriptObfuscatedMacroCodeType": "userDefined",
    "defenderScriptObfuscatedMacroCode": "userDefined",
    "defenderScriptDownloadedPayloadExecutionType": "userDefined",
    "defenderScriptDownloadedPayloadExecution": "userDefined",
    "defenderPreventCredentialStealingType": "userDefined",
    "defenderProcessCreationType": "userDefined",
    "defenderProcessCreation": "userDefined",
    "defenderUntrustedUSBProcessType": "userDefined",
    "defenderUntrustedUSBProcess": "userDefined",
    "defenderUntrustedExecutableType": "userDefined",
    "defenderUntrustedExecutable": "userDefined",
    "defenderEmailContentExecutionType": "userDefined",
    "defenderEmailContentExecution": "userDefined",
    "defenderAdvancedRansomewareProtectionType": "userDefined",
    "defenderGuardMyFoldersType": "userDefined",
    "defenderGuardedFoldersAllowedAppPaths": [],
    "defenderAdditionalGuardedFolders": [],
    "defenderNetworkProtectionType": "userDefined",
    "defenderExploitProtectionXml": null,
    "defenderExploitProtectionXmlFileName": null,
    "defenderSecurityCenterBlockExploitProtectionOverride": false,
    "appLockerApplicationControl": "notConfigured",
    "deviceGuardLocalSystemAuthorityCredentialGuardSettings": "notConfigured",
    "deviceGuardEnableVirtualizationBasedSecurity": false,
    "deviceGuardEnableSecureBootWithDMA": false,
    "deviceGuardLaunchSystemGuard": "notConfigured",
    "smartScreenEnableInShell": false,
    "smartScreenBlockOverrideForFiles": false,
    "applicationGuardEnabled": false,
    "applicationGuardEnabledOptions": "notConfigured",
    "applicationGuardBlockFileTransfer": "notConfigured",
    "applicationGuardBlockNonEnterpriseContent": false,
    "applicationGuardAllowPersistence": false,
    "applicationGuardForceAuditing": false,
    "applicationGuardBlockClipboardSharing": "notConfigured",
    "applicationGuardAllowPrintToPDF": false,
    "applicationGuardAllowPrintToXPS": false,
    "applicationGuardAllowPrintToLocalPrinters": false,
    "applicationGuardAllowPrintToNetworkPrinters": false,
    "applicationGuardAllowVirtualGPU": false,
    "applicationGuardAllowFileSaveOnHost": false,
    "bitLockerAllowStandardUserEncryption": true,
    "bitLockerDisableWarningForOtherDiskEncryption": true,
    "bitLockerEnableStorageCardEncryptionOnMobile": false,
    "bitLockerEncryptDevice": true,
    "firewallRules": [],
    "bitLockerSystemDrivePolicy": {
        "encryptionMethod": "xtsAes256",
        "startupAuthenticationRequired": true,
        "startupAuthenticationBlockWithoutTpmChip": false,
        "startupAuthenticationTpmUsage": "allowed",
        "startupAuthenticationTpmPinUsage": "allowed",
        "startupAuthenticationTpmKeyUsage": "allowed",
        "startupAuthenticationTpmPinAndKeyUsage": "allowed",
        "minimumPinLength": null,
        "prebootRecoveryEnableMessageAndUrl": false,
        "prebootRecoveryMessage": null,
        "prebootRecoveryUrl": null,
        "recoveryOptions": {
            "blockDataRecoveryAgent": false,
            "recoveryPasswordUsage": "allowed",
            "recoveryKeyUsage": "allowed",
            "hideRecoveryOptions": true,
            "enableRecoveryInformationSaveToStore": true,
            "recoveryInformationToStore": "passwordAndKey",
            "enableBitLockerAfterRecoveryInformationToStore": true
        }
    },
    "bitLockerFixedDrivePolicy": {
        "encryptionMethod": "xtsAes128",
        "requireEncryptionForWriteAccess": false,
        "recoveryOptions": null
    },
    "bitLockerRemovableDrivePolicy": {
        "encryptionMethod": "aesCbc128",
        "requireEncryptionForWriteAccess": false,
        "blockCrossOrganizationWriteAccess": false
    }
}
