{
    "@odata.type":  "#microsoft.graph.androidCompliancePolicy",
    "description":  "Device Compliance Policy for Android.",
    "displayName":  "DCO-AND",
    "passwordRequired":  true,
    "passwordMinimumLength":  4,
    "passwordRequiredType":  "deviceDefault",
    "passwordMinutesOfInactivityBeforeLock":  5,
    "passwordExpirationDays":  180,
    "passwordPreviousPasswordBlockCount":  5,
    "passwordSignInFailureCountBeforeFactoryReset":  null,
    "securityPreventInstallAppsFromUnknownSources":  true,
    "securityDisableUsbDebugging":  true,
    "securityRequireVerifyApps":  false,
    "deviceThreatProtectionEnabled":  false,
    "deviceThreatProtectionRequiredSecurityLevel":  "unavailable",
    "securityBlockJailbrokenDevices":  true,
    "osMinimumVersion":  "4.4",
    "osMaximumVersion":  null,
    "minAndroidSecurityPatchLevel":  null,
    "storageRequireEncryption":  true,
    "securityRequireSafetyNetAttestationBasicIntegrity":  false,
    "securityRequireSafetyNetAttestationCertifiedDevice":  false,
    "securityRequireGooglePlayServices":  false,
    "securityRequireUpToDateSecurityProviders":  false,
    "securityRequireCompanyPortalAppIntegrity":  true,
    "conditionStatementId":  null,
    "restrictedApps":  [

                       ]
}
